{
  "intents":
  [ 
    {
      "tag": "pembuka",
			"patterns": ["hi", "hai", "hey", "hei", "apakah ada orang disana?", "hello", "halo", "hay", "ini itu apa ya?"],
			"responses": ["Hallo saya Kuji! Saya disini siap membantu kamu", "Hallo saya Kuji! Ada yang bisa saya bantu?", "Hallo saya Kuji!, asisten bot yang siap membantu kamu"]
	  },
    {
			"tag": "penutup",
			"patterns": ["terima Kasih", "bye", "thanks", "thank you", "ini sangat membantu", "terima Kasih untuk bantuannya", "oke mks"],
			"responses": ["Terima Kasih sudah menggunakan TemanHewan", "Semoga lekas sembuh", "Senang bisa membantu kamu", "Sama-sama!", "Semoga semuanya segera membaik, Kuji selalu siap membantu kamu disini 24/7"]
		},
		{
			"tag": "bantuan",
			"patterns": ["tolong bantu saya", "apa yang dapat anda lakukan untuk saya?", "tolong hewan saya", "saya butuh bantuan"],
			"responses": ["Jelaskan pada saya bagaimana keadaan hewan peliharaan mu?", "Ceritakan masalah hewan kamu agar aku bisa membantu", "Apa yang terjadi pada hewan mu?", "Gejala apa yang terjadi pada hewan mu?"]
		},
		{
			"tag": "keluhan",
			"patterns": ["complaint", "komplen", "komplain", "saya ingin mengajukan keluhan", "ada masalah dengan layanan"],
			"responses": ["Silahkan hubungi support@temanhewan.com dan mohon maaf atas ketidaknyamanan yang ditimbulkan"]
		},  
    {
        "tag": "Rabies",
        "patterns": ["Anjing saya suka bersembunyi di tempat sunyi. Kadang dia juga cepat marah atau berlari kesana kemari. Diberi makan ngga mau, diberi minum malah takut. Air liurnya kadang bocor juga kayak gila gitu", "anjing saya terus bersembunyi ditempat sunyi dan marah-marah. Ia juga takut terhadap air serta terus mengeluarkan air liur. Ia tidak mau makan dan terus lari-larian.", "kenapa anjing saya jadi cepat marah dan ga mau makan? dia juga sering ngumpet di tempat sepi, lari sono sini, keluar iler trus takut aer juga itu kenapa ya? "],
        "responses": ["Definisi:\nRabies adalah infeksi virus pada otak dan sistem saraf. Umumnya, virus penyebab rabies menular ke manusia melalui gigitan hewan. Rabies tergolong penyakit berbahaya karena berisiko menyebabkan kematian jika tidak cepat ditangani.\n\nPenyebab:\nRabies disebabkan oleh virus yang umumnya ditularkan dari anjing melalui gigitan, cakaran, atau air liur. Selain anjing, hewan yang juga dapat membawa virus rabies dan menularkannya ke manusia antara lain kera, kucing, musang, dan kelinci. Pada kasus yang jarang terjadi, penularan virus rabies juga dapat terjadi dari manusia ke manusia, melalui transplantasi organ.\n\nPenanganan:\nDibawa ke Dinas Peternakan atau dokter hewan yang berwenang. "],
        "context_set": [""]
    },
    {
        "tag": "Scabies",
        "patterns": ["Anjing saya ada lecet sama lesi di ujung telinganya, kerak, bintik botak di sekitar kepala. Bulu ekornya kadang rontok kadang berminyak. Bulu yang lain juga rontok. Yang saya takutkan itu dia sering menggaruk berlebihan di tempat yang aneh aneh tadi", "anjing saya terus-terusan menggaruk hingga bulunya rontok. telinganya juga lecet. Banyak bintik botak dan bulu ekornya rontok.", "anjing saya sering garuk ujung telinganya sampe lecet, ada bintik botak dan keraknya juga, trus bulunya pada rontok terutama bulu ekor berminyak juga itu kenapa ya?"],
        "responses": ["Definisi:\nScabies yang terjadi pada hewan anjing adalah sebuah penyakit kulit yang dikarenakan adanya infestasi parasit luar sejenis tungau (tidak dapat dilihat tanpa menggunakan alat bantu) yang hidup di dalam folikel kulit. Keberadaan scabies ini ditandai dengan adanya jaringan kulit yang mengalami kerusakan serta infeksi sekunder (pembusukan) yang diakibatkan adanya mikroorganisme patogen. Penyakit seperti ini memiliki sifat zoonosis atau bisa menular ke manusia dimana akan memunculkan gejala berupa gatal – gatal serta peradangan di bagian kulit selepas kontak langsung dengan anjing yang terkontaminasi penyakit satu ini.\n\nPenyebab:\nDikarenakan adanya infestasi parasit luar sejenis tungau (Sarcoptes scabiei) yang kemudian hidup serta berkembang biak di dalam jaringan folikel kulit si anjing. Ditularkan melalui anjing yang sebelumnya sudah menderita scabies. Ditularkan melalui lingkungan seperti kandang serta lingkungan sekitar yang sangat kotor. Kontak langsung dengan berbagai benda yang di dalamnya sudah terkontaminasi parasit penyebab scabies.\n\nPenanganan:\nSebaiknya anjing yang mengalami scabies dimandikan dengan air belerang dan juga dengan air daun ketapang "],
        "context_set": [""]
    },
    {
        "tag": "Distemper Anjing",
        "patterns": ["Anjing saya demam, panas dia. Kena diare juga, mana bau lagi. Kayaknya kena dehidrasi juga dia ", "anjing saya diare berbau dan demam beberapa hari ini. Dia terlihat dehidrasi.", "anjing saya jadi sering pup trus badannya juga panas tinggi kayanya dia dehidrasi gitu itu kenapa ya?"],
        "responses": ["Definisi:\nDistemper anjing adalah penyakit menular bersifat akut sampai subakut pada hewan yang disebabkan oleh Canine morbillivirus. Virus ini menyerang saluran pencernaan, pernapasan, dan sistem saraf pusat. Anjing pada semua umur rentan terhadap serangan virus ini, tetapi anjing muda lebih sering terinfeksi.\n\nPenyebab:\nCanine distemper virus (CDV) dikenal sebagai penyebab distemper anjing. Namun, pada 2016 Komite Internasional Taksonomi Virus (ICTV) mengubah nama spesies virus ini menjadi Canine morbillivirus. Anjing berusia muda dan anjing yang belum divaksin lebih rentan terhadap infeksi virus ini.\n\nPenanganan:\n-Pemberian vaksin sebelum penyakit berkembang.\n-Bawa segera ke klinik hewan terdekat. "],
        "context_set": [""]
    },
    {
        "tag": "Hepatitis",
        "patterns": ["Anjing saya suka muntah. Dia juga kena demam jadinya dehidrasi sampai kurus gitu. Sama pas dicek ronsen hatinya membengkak, benjol", "Anjing saya muntah-muntah dan demam. Dia juga dehidrasi sangat parah. Hatinya membengkak.", "anjing saya muntah terus, panas tinggi seperti demam, dehidrasi banget juga kayanya hatinya bengkak itu kenapa ya?"],
        "responses": ["Definisi:\nHepatitis menular pada anjing adalah kondisi yang sangat serius di seluruh dunia, penyakit anjing ini disebabkan oleh virus sangat menular yang menyerang hati. Virus ini dapat berkembang sangat cepat pada anak anjing dan anjing dewasa. Tingkat kematian anjing dengan penyakit hepatitis ini berkisar antara 10 - 30%, biasanya paling tinggi pada anjing yang masih kecil.\n\nPenyebab:\nHepatitis pada anjing ini ditularkan melalui darah, cairan hidung, air liur, urin, atau kotoran anjing yang terinfeksi. Virus penyebab penyakit ini dapat bertahan lama di area tempat hidup anjing dan sulit dibasmi karena tahan terhadap pelarut lipid seperti eter, serta asam dan formalin.\n\nPenanganan:\n-Untuk penanganan awal berikan anjing minum air gula atau bisa diberikan juga curcuma (kunyit).\n-Bawa segera ke klinik hewan terdekat "],
        "context_set": [""]
    },
    {
        "tag": "Canine Parvovirus",
        "patterns": ["Anjing saya sering muntah, terus kena demam sampai dehidrasi tinggi sampai Lelah gitu. Sering lesu dia sampai hilang nafsu makan. Pas BAB ada darah sama baunya ngga kayak biasanya", "Anjing saya muntah-muntah dan di kotorannya ada darah. Kotorannya juga mengeluarkan bau yang berbeda dari biasanya. Ia juga tidak mau makan, dehidrasi, lesu, dan demam.", "anjing saya jarang makan, lemes, sering muntah, badannya panas tinggi seperti demam, dehidrasi parah kayanya dia, di pupnya ada darah baunya aneh"],
        "responses": ["Definisi:\nCanine parvovirus sangat menular dan disebabkan oleh virus yang sangat resisten di lingkungan rumah. Penyakit anjing ini menyebabkan gastroenteritis parah dan sering kali menyebabkan komplikasi pendarahan. Jika anjing betina terkontaminasi selama kebuntingan, virus ini akan memengaruhi janinnya saat berkembang. Virus ini tidak dapat berplikasi sendiri, dan akibatnya harus menggunakan sel lain untuk membantunya berkembang biak. Pada anak-anak anjing, canine parvovirus akan mengkolonisasi sel-sel saluran pencernaan karena mereka beregenerasi dengan laju yang cepat. Canine parvovirus ini bisa berakibat fatal dan merupakan penyakit yang terus memengaruhi populasi anak anjing.\n\nPenyebab:\nAnjing yang terinfeksi canine parvovirus menularkan virusnya dalam jumlah besar melalui kotoran. Dalam 1g feses dapat mengandung hingga 1 juta dosis agen infeksius, yaitu cukup untuk menginfeksi 1 juta hewan dalam kondisi eksperimen. Virus ini dapat ditularkan oleh manusia, hewan, atau benda apa pun yang bersentuhan dengan kotoran hewan yang terinfeksi. Penyakit itu sendiri sangat sulit dihilangkan dari lingkungan luar, seperti pada kandang pembiak anak anjing. Dalam kondisi tertentu, virus ini dapat bertahan di lingkungan selama beberapa bulan, bahkan lebih dari setahun.\n\nPenanganan:\n-Berikan obat penghenti mencret (Norit)\n-Berikan minum air gula\n-Segera  dibawa  ke  klinik  hewan  untuk mendapatkan penanganan yang lebih. "],
        "context_set": [""]
    },
    {
        "tag": "Herpesvirus",
        "patterns": ["Anjing saya sering muntah. Terus dia sering lesu sampai ngga mau memberi susu ke anaknya. Suka raung ngga jelas juga", "Anak anjing saya muntah-muntah. Ia tidak mau menyusui dan sering meraung-raung. Anak anjing saya lesu.", "anak anjing saya muntah terus lemes sering meraung itu kenapa ya?"],
        "responses": ["Definisi:\nCanine Herpervirus (CHV) merupakan herpesvirus yang sensitive terhadap kebanyakan desinfektan (eter dan kloroform). Virus ini rentan di lingkungan, sehingga kontak langsung diperlukan untuk transmisi. Transmisi biasanya terjadi pada individu rentan, dengan anjing terinfeksi yang melepaskan virus melalui sekresi oral, nasal, dan vaginal. Hewan terinfeksi yang cukup baik imunitasnya, umumnya tanpa gejala (subklinis), namun melepas (shedding) virus dari sekretnya.\n\nPenyebab:\nCHV biasanya menginfeksi anjing berumur 1-4 minggu hingga 3 bulan, dan jarang pada umur 6 bulan. Gejala dapat terlihat atau tidak, dengan onset tiba-tiba dalam 24 jam. Jika terdapat gejala klinis, maka letargi, diare, nasal-ocular discharge, conjunctivitis, edema korneal, erythematous rash, vaginitis-phostitis langka, dan lepuhan-lepuhan oral, dengan atau tanpa demam. Pnumonia secara radiograf terlihat pola interstisial pattern yang khas pada kebanyakan viral pneumonia. Perbedaan kontras pada penyakit viral lain adalah leukositosis dapat terjadi. Sindrom “kennel cough” dapat meliputi CHV pada kebanyakan anjing. Rhinitis hingga vaginitis dan phostitis umum disertai lepuhan vesicular. Pada anjing berumur 1-4 minggu, penyakit ini sangat mematikan, karena mereka belum memiliki sifat antibodi yang berkembang dan adaptif terhadap infeksi alami. Anak anjing bisa terinfeksi selama masa perkembangan janin dalam kandungan akibat induk terinfeksi trimester akhir, selama masa kelahiran, atau paparan langsung virus dilingkungan pada minggu-minggu pertama kehidupan. Kasus pada anjing 8 minggu hingga 12 minggu jarang terjadi, namun tetap rentan. Pada anjing dewasa, gejala tidak terlihat, namun dapat berkembang pada saluran respirasi atas dan bawah, berkembang bersama ‘kennel cough’.\n\nPenanganan:\n-Pada saat ini belum ditemukan obatnya.\n-Untuk  lebih  pastinya  lebih  baik anjing dibawa  langsung  ke  klinik  hewan  atau dokter spesialisnya. "],
        "context_set": [""]
    },
    {
        "tag": "Papilomatosis",
        "patterns": ["anjing saya ada kutilnya dibagian mulut, terus nafasnya bau aneh gitu", "nafas anjing saya bau dan ada kutil di mulutnya", "ada kutil di mulut anjing dan nafasnya bau"],
        "responses": ["Definisi:\nPenyakit Kutil pada anjing atau dalam medisnya bernama papilomatosis merupakan penyakit viral menular pada anjing muda dan disertai pertumbuhan kutil secara liar pada kulit atau selaput lendir. Jadi dengan pengobatan antibiotik jenis apapun tidak dapat menyembuhkannya, pengobatan yang bisa dilakukan adalah menggunakan materi kutil untuk dijadikan vaksin secara autoimmune.\n\nPenyebab:\nMasuknya penyakit kutil ke anjing ini berasal dari luar, bisa karena adanya anjing lain yang terinfeksi kutil atau secara tidak langsung melalui benda-benda perantara yang terkontaminasi virus tersebut. Papiloma atau kutil yang terbentuk terdiri dari jaringan mesenkim dan epidermis.\n\nPenanganan:\n-Adapun cara untuk memberantas penyakit papilomatosis ini antara lain dengan melakukan vaksinasi dan juga pembedahan.\n-Disarankan agar dibawa ke klinik hewan terdekat."],
        "context_set": [""]
    },
    {
        "tag": "Dirofilaria immitis",
        "patterns": ["Anjing saya kena kutu banyak ngumpul dia, jadi kulitnya berkerak, mana suka digaruk lagi takut saya. Bulunya juga rontok", "Anjing sering menggaruk-garuk hingga bulunya rontok. Setelah dilihat pada permukaan kulitnya ada kutu berkelompok. kulitnya terlihat berkerak.", "anjing saya gatel-gatel bulunya rontok dan dikulitnya banyak kutu sampai berkerak"],
        "responses": ["Definisi:\nHeartworm pada anjing merupakan suatu penyakit kecacingan yang disebabkan oleh parasit cacing genus Dirofilaria immitis yang menyerang dan berkembang biak di organ jantung sehingga sering disebut penyakit cacing jantung. Akan tetapi cacing tersebut juga bisa menyerang organ hati, paru dan ginjal. Anjing dapat terserang penyakit heartworm dari gigitan nyamuk Anopheles sp. dan Culex sp. yang terinfeksi larva cacing jantung (mikrofilaria). Nyamuk tersebut membawa mikrofilaria kemudian disebarkan pada saat menghisap darah anjing menuju jantung, paru, ginjal dan menjadi dewasa dan berkembang biak di lokasi tersebut. Penyakit ini sangat berbahaya bagi anjing karena bisa mengakibatkan kematian karena rusaknya organ dalam seperti jantung, paru, hati dan ginjal. Selain itu akibat jumlah cacing yang sangat banyak dapat mengganggu sisitem sirkulasi darah di dalam jantung yang akan diedarkan ke seluruh tubuh, peredaran darah dari organ-organ lain yang kembali menuju jantung akan terblokir dan tersumbat yang disebut sebagai sindrom caval.\n\nPenyebab:\nParasit cacing jantung Dirofilaria immitis yang disebarkan melalui gigitan nyamuk Anopheles sp. dan Culex sp. pada saat menghisap darah anjing.\n\nPenanganan:\nPenanganan penyakit ini harus dilakukan langsung oleh ahlinya. Oleh karena itu sebaiknya dibawa ke klinik dokter hewan. "],
        "context_set": [""]
    },
    {
        "tag": "Pruritus",
        "patterns": ["anjing saya ada iritasi tuh, malah suka dia gigit atau digaruk biasanya. Mana geleng geleng kepala ngga jelas lagi", "Anjing sering menggaruk-garuk dan menggeleng-gelengkan kepala. Ia juga sering menggigit daerah yang iritasi.", "anjing saya bulunya rontok sering garuk-garuk dikulitnya ada kerak dan banyak kutu"],
        "responses": ["Definisi:\nPruritus adalah rasa gatal atau rasa tidak nyaman pada kulit yang merangsang keinginan untuk menggaruk, menggosok, menjilat, atau menggigit bagian tersebut. Pada kondisi normal, pruritus diperlukan anjing untuk membersihkan tubuh dan menghilangkan ektoparasit serta senyawa atau bahan-bahan yang berbahaya dari permukaan kulit. Sebaliknya, apabila reaksinya berlebihan pruritus dapat menyebabkan perlukaan diri sendiri atau self mutilation yang mengakibat luka lecet pada permukaan kulit.\n\nPenyebab:\nPenyebab penyakit ini adalah parasit, infeksi jamur, alergi karena makanan dan bukan tidak mungkin juga kalau si penderita mengidap penyakit kelenjar, tiroid dan lain-lain. Biasanya terjadi pada jenis peliharaan yang perawatannya kurang higienis. Bisa juga karena kulit kering, suhu udara yang terlalu panas/dingin dan terkena cahaya/sinar/listrik, dll.\n\nPenanganan:\n-Cukur bulu terutama dibagian yang korengan atau meradang\n-Mandikan dengan shampoo anti jamur yang bisa anda beli di petshop atau klinik hewan\n-Lakukan perawatan secara konsisten dan disiplin. Lakukan pembersihan pada tempat makan dan minumnya juga dengan tempat tidur atau kandang anjing anda."],
        "context_set": [""]
    },
    {
        "tag": "Ringworm anjing",
        "patterns": ["anjing saya ada kulit yg memerah gitu, ada keraknya, bintik botak, bulunya rontok, patah patah, ada ketombenya. Terus kulitnya kayak kering gitu, dagunya bengkak, ada luka aneh juga di kaki depan, sama basah dibelakan leher. Parahnya dia suka garuk itu yg berdarah sama berkerak itu", "anjing saya garuk-garuk terus, di badannya ada kerak dan bulunya jadi rontok. pas saya cek di badannya ada luka melingkar gitu di kaki depannya dan ada luka basah di belakang leher. bulu yang rontok juga patah-patah.", "anjing saya bulunya rontok dan patah, dia sering garuk kulitnya yg kering merah-merah ada bintik botaknya, dagu dia bengkak, ada luka basah di belakang leher dan luka bulet di kaki bagian depan"],
        "responses": ["Definisi:\nRingworm merupakan penyakit kulit yang disebabkan oleh infeksi jamur. Biasanya daerah luka biasanya berada di sekitar lipatan leher, lipatan mata, lipatan paha, ekor dan daerah kuku.Daerah luka biasanya berbentuk seperti cincin melingkar. Penyakit ini bersifat zoonosis bisa menular ke manusia, disarankan apabila terjadi kontak antara manusia dengan anjing penderita segera cuci tangan pakai detergen.\n\nPenyebab:\nSejenis jamur Microsporum canis, Trichophyton mentagrophytes dan Microsporum gypseum\nBiasanya dari lingkungan yang kotor\nTertular dari anjing penderita\nAsupan gizi yang jelek sehingga menimbulkan kekebalan yang menurun dan mudah terserang penyakit.\n\nPenanganan:\n- Perawatan antijamur termasuk agen topikal seperti miconazole, terbinafine, clotrimazole, ketoconazole, atau tolnaftate diterapkan dua kali sehari sampai gejala sembuh, biasanya dalam satu atau dua minggu.\n- Perawatan topikal kemudian harus dilanjutkan selama 7 hari lebih lanjut setelah resolusi gejala yang terlihat untuk mencegah kekambuhan.\n- Oleh karena itu, durasi total pengobatan umumnya dua minggu, tetapi mungkin selama tiga minggu.\n- Dalam kasus yang lebih parah atau kurap kulit kepala, pengobatan sistemik dengan obat oral dapat diberikan.\n- Untuk mencegah penyebaran infeksi, lesi tidak boleh disentuh, dan kebersihan yang baik dijaga dengan mencuci tangan dan tubuh. "],
        "context_set": [""]
    },
    {
        "tag": "Alergic Dermathitis anjing",
        "patterns": ["anjing saya tu kulitnya memerah gitu, ada keraknya juga. Mana suka dia garuk lagi takut jadinya. Bulunya ada rontok juga, terus dia kena radang gitu", "anjing saya menggaruk badannya berlebihan hingga bulunya rontok. kulitnya memerah dan meradang disertai dengan kerak.", "anjing saya radang dan sering garuk kulit yang kemerahan dan ada keraknya, bulunya pada rontok"],
        "responses": ["Definisi:\nCanine atopic dermatitis (CAD) pada anjing adalah peradangan yang terjadi pada kulit. Tanda yang dapat dilihat pada kasus CAD antara lain anjing merasa gatal, suka menggaruk, kulit kemerahan, rambut rontok, dan terdapat kebotakan di beberapa area tubuh. CAD sering terjadi pada ras pug, bulldog, german shepherd, labrador, dan siberian husky. Kasus ini paling sering terjadi pada anjing yang struktur kulitnya berlipat-lipat, seperti pug dan bulldog. Hal ini diakibatkan lipatan kulit sering bergesekan satu sama lain sehingga menyebabkan iritasi. CAD juga sering terjadi pada anjing yang obesitas. Kondisi obesitas atau tingginya kadar lemak dalam tubuh mengakibatkan produksi minyak yang berlebih sehingga kulit dan bulu akan terasa lengket dan gatal. Kondisi tersebut memicu anjing untuk selalu menggaruknya sehingga akan terjadi dermatitis.\n\nPenyebab:\nEctoparasit, Infeksi mikroba, Alergi.\n\nPenanganan:\n-Dermatitis alergi pada Anjing dapat diobati dengan beberapa cara, termasuk penghindaran alergen, terapi simtomatik, imunoterapi atau terapi penekan kekebalan tubuh.\n-Penghindaran Alergen, Mengeluarkan anjing Anda dari sumber alergen atau menjauhkan alergen dari anjing.\n-Terapi Simtomatik, Antimikroba, sampo obat, salep, suplemen dan obat-obatan lain dapat digunakan untuk mengobati gejala yang terkait dengan dermatitis alergi.\nImunoterapi, Proses desensitisasi anjing terhadap alergen melalui penggunaan protein alergen.\nTerapi Imunosupresif, Mengobati kondisi anjing dengan steroid dan obat siklosporin untuk mengurangi respons imun. "],
        "context_set": [""]
    },
    {
        "tag": "Kutu Lice anjing",
        "patterns": ["Anjing saya itu komedoan, jerawatan, bulunya juga pucat sama kayak menipis gitu. Dia suka garukgarukin itu yg jerawatan ngga bahaya kah", "anjing saya akhir-akhir ini menggaruk badannya secara berlebihan dan bulunya menipis. warna bulunya juga pucat dan ketika saya pegang badannya ada jerawat.", "bulu anjing saya pucet dan menipis, garu-garuk terus ada jerawat dan komedo"],
        "responses": ["Definisi:\nAda tiga spesies kutu yang menyerang anjing, yaitu Linognathus setosus (kutu penghisap darah), Trichodectes canis (kutu penggigit), dan Heterodoxus spiniger (kutu penggigit yang memakan darah). Anjing yang memiliki kondisi kesehatan buruk sangat mudah diserang kutu. Perlu diwaspadai, Trichodectes canis adalah kutu yang berfungsi sebagai perantara cacing pita di usus anjing.\n\nPenyebab:\nTanda pertama anjing yang terinfeksi kutu yaitu saat ia sering menggaruk, menggigit, dan menggosok area yang terinfeksi. Anjing yang dihinggapi kutu biasanya memiliki bulu yang kasar dan kering. Rambut anjing juga tampak kusut jika kutunya banyak.\n\nPenanganan:\n- Mengisolasi Anjing Anda: Ini hanya langkah yang diperlukan jika Anda memiliki lebih dari satu Anjing di rumah Anda dan diperlukan untuk mencegah mentransfer kutu ke Anjing lain. Hal terbaik yang dapat Anda lakukan adalah menjaga Anjing yang terkena di ruangan lain selama perawatan. Mengisolasi Anjing Anda juga mengurangi jumlah pembersihan yang diperlukan untuk menghilangkan kutu.\n- Perawatan Obat: Dokter hewan Anda akan merekomendasikan perawatan insektisida untuk Anjing Anda, yang mungkin termasuk mencuci obat atau sampo. Yang terbaik adalah berbicara dengan dokter hewan Anda sehingga Anda dapat memastikan obat itu aman untuk Anjing Anda.\n- Perawatan Rumah: Anda juga dapat meminta dokter hewan Anda untuk merekomendasikan produk untuk menyingkirkan kutu di sekitar rumah. Ada berbagai semprotan dan bubuk yang dirancang untuk menghilangkan nits dan kutu dari rumah Anda. Ini adalah langkah penting.\n- Mencukur Bulu: Dokter hewan Anda hanya akan merekomendasikan mencukur bulu jika kusut parah. Seharusnya tidak diperlukan untuk mengobati sebagian besar infestasi. "],
        "context_set": [""]
    },
    {
        "tag": "Pemphigus anjing",
        "patterns": ["Anjing saya itu ada bengkak sama rontok bulunya. Kulitnya memerah, terus suka dia garuk ga jelas gitu. Dia juga kena demam kayaknya", "anjing saya terlihat gatal dan terus menggaruk hingga kulitnya kemerahan. ia juga mengalami demam serta bengkak pada tubuh.", "badan anjing saya bengkak dan panas tinggi, bulunya rontok karena sering digaruk kulitnya memar"],
        "responses": ["Definisi:\nPemfigus merupakan penyakit kulit langka dan serius yang disebabkan karena adanya masalah pada sistem kekebalan tubuh. Penyakit ini ditandai dengan munculnya bula yang menyerupai bisul pada kulit atau membran mukosa (misalnya di dalam mulut atau alat kelamin). Bula ini mudah sekali pecah dan akan meninggalkan bekas seperti luka lepuh yang rentan menjadi sarang infeksi.\n\nPenyebab:\npenyebab pasti timbulnya pemfigus masih belum diketahui. Namun, faktor yang diduga menjadi penyebabnya adalah faktor genetik. Pemfigus lebih sering menyerang orang yang sudah mengidap penyakit autoimun lainnya (terutama miastenia gravis dan timoma).\n\nPenanganan:\n-Pengobatan membutuhkan penekanan kekebalan dan imunomodulator. Jangan mengobati daun pemphigus tanpa diagnosis dan penghapusan diferensial lainnya.\n1. Glukokortikoid adalah pengobatan awal yang paling umum, karena mereka adalah agen anti-inflamasi dan  imunomodulator yang kuat. Ada banyak mekanisme tindakan yang berguna dalam pengobatan penyakit kulit autoimun, tetapi yang paling menonjol adalah efek pada kekebalan humoral dan dimediasi sel, pertahanan fagosit, penghambatan mediator inflamasi, dan penekanan tingkat autoantibodi.\n2. Chlorambucil paling sering digunakan pada kucing ketika monoterapi glukokortikoid tidak cukup. Seseorang harus memantau myelosuppression selain muntah, diare, dan anoreksia. CBC dengan jumlah trombosit direkomendasikan sebelum pengobatan dan seperti yang ditunjukkan selama pengobatan.\n3. Chyrsotherapy adalah penggunaan garam emas. Penggunaan chrysotherapy dan glukokortikoid telah terbukti efektif dalam pengobatan feline PF. Garam emas memiliki efek imunomodulator dan anti-inflamasi.\n4. Siklosporin adalah obat imunosupresif nonsteroid yang kadang-kadang diresepkan. Respon klinis bervariasi dalam penyakit autoimun dan paling sering dilembagakan dalam upaya untuk mengurangi jumlah glukokortikoid yang digunakan. Efek samping termasuk muntah, diare, anoreksia, penurunan berat badan, hiperplasia gingiva, hirsutisme, dan papillomatosis. "],
        "context_set": [""]
    },
    {
        "tag": "Salmonella",
        "patterns": ["anjing saya kayaknya depresi sampai kena demam. Dehidrasi juga jadi Lelah gitu. Sama diarean sampai berdarah itu bahaya kan", "anjing saya kuping dan hidungnya panas, sepertinya dia demam. Ia juga diare berlebih disertai darah. terlihat sangat lemah.", "badan anjing saya panas tinggi seperti demam dan diare terus ada darahnya kaya depresi dan dehidrasi"],
        "responses": ["Definisi:\nSalmonellosis pada anjing merupakan suatu penyakit yang disebabkan oleh bakteri gram negatif Salmonella sp. dengan ditandai oleh adanya penyakit keradangan pada lambung dan usus (gastroenteritis), keguguran pada anjing yang sedang bunting (abortions), dan adanya multipikasi bakteri di dalam darah (septicemia).\n\nPenyebab:\nBakteri gram negatif  Salmonella sp. yang bersifat enterobakteria (beracun) berjumlah lebih dari 2000 tipe.\n\nPenanganan:\n- Hindarkan kontak dan akukan isolasi/karantina terhadap anjing penderita sampai benar-benar sembuh.\n- Memberikan antibiotik yang tepat untuk membunuh bakteri salmonella, obat anti radang dan anti muntah, fluid therapy (infus) untuk  mengatasi dehidrasi, dan vitamin untuk meningkatkan nafsu makannya. "],
        "context_set": [""]
    },
    {
        "tag": "Gastroenteritis",
        "patterns": ["anjing saya itu kayaknya kelelahan sampai sakit kepala sama nyeri otot. Mana sering muntah sampai diarean. Kena demam panas juga", "anjing saya diare dan muntah. ia juga terlihat kelelahan, lemah, dan tidak nafsu makan.", "anjing saya badannya lemes serta panas tinggi seperti demam, diare, dan muntah"],
        "responses": ["Definisi:\nLa gastroenteritis pada anjing itu adalah penyakit yang mirip dengan yang kita derita. Secara umum ini bukan penyakit yang serius, Anda tidak selalu harus pergi ke dokter hewan dan dalam sebagian besar kasus tidak berakibat fatal, tetapi hanya membutuhkan beberapa hari penyembuhan untuk anjing dan perawatan dasar di pihak kami sehingga itu pulih.\n\nPenyebab:\nRadang selaput lendir dapat terjadi karena berbagai faktor, dari virus hingga bakteri atau parasit. Ini bisa disebabkan oleh infeksi virus, jamur atau bakteri, tetapi juga karena makan makanan basi, makan tanaman beracun atau makan makanan yang tidak enak. Dalam situasi stres yang berkepanjangan, mukosa usus juga dapat diubah dan menyebar ketika terjadi kontak dengan anjing yang mengidap penyakit tersebut. Bergantung pada kesehatan anjing, ini bisa lebih atau kurang kuat.\n\nPenanganan:\nAerosol, Bubuk, Shampoo, Semprotan, Dips, Bilasan, Busa, Spot-ons. Disuntikkan, Tablet oral, Cairan oral, Berbagai jenis kerah yang diresapi "],
        "context_set": [""]
    },
    {
        "tag": "gastritis radang perut",
        "patterns": ["anjing saya sering bersendawa, nafsu makannya hilang tapi kalau mau makan malah kenyang dini. Perutnya juga malah kembung anehnya. Suka mual sama muntah habis makan. Pas dicek dia kena nyeri perut tengah atas, berat badannya juga turun ngga jelas gitu", "anjing saya muntah-muntah lebih dari 14 hari. Di muntahannya ada makanan dan cairan empedu. nafsu makannya juga menurun dan terlihat sakit perut.", "anjing saya muntah dan tidak nafsu makan sehingga beratnya turun drastis"],
        "responses": ["Definisi:\nGastritis merupakan peradangan, pengikisan, atau iritasi pada lapisan sistem pencernaan anjing. Apabila mukosa lambung terus-menerus meradang, maka dapat terjadi luka pada lambung yang menyebabkan infeksi atau bahkan sumbatan pada saluran cerna.\n\nPenyebab:\n>Gastritis dapat disebabkan oleh zat atau bahan makanan yang telah terkontaminasi, beracun, atau tidak dapat dicerna oleh anjing, seperti :\n-Makanan mentah\n-Makanan busuk\n-Kotoran kucing\n-Tanaman tertentu yang beracun bagi anjing\n-Makanan manusia yang beracun bagi anjing\n-Jamur atau kapang\n-Benda asing atau benda bukan makanan\n-Zat beracun seperti bahan kimia atau cairan pembersih\n-Obat-obatan.\n\n>Gastritis juga dapat disebabkan oleh :\n-Infeksi virus, bakteri, atau parasit\n-Paparan zat alergen dalam jangka waktu yang lama\n-Penyakit autoimun\n-Kanker perut\n-Gagal ginjal\n-Penyakit radang usus\n-Ulkus\n-Penyakit neurologis.\n\nPenanganan:\nAntasida adalah pengobatan umum untuk gastritis ringan hingga sedang. Ketika antasida tidak memberikan bantuan yang cukup, obat-obatan seperti H2 blocker dan inhibitor pompa proton yang membantu mengurangi jumlah asam sering diresepkan. Agen sitoprotektif dirancang untuk membantu melindungi jaringan yang melapisi perut dan usus kecil. Mereka termasuk obat sukralfat dan misoprostol. Jika NSAID diambil secara teratur, salah satu obat ini untuk melindungi perut juga dapat diambil. Agen sitoprotektif lainnya adalah bismut subsalicylate. Beberapa rejimen digunakan untuk mengobati infeksi H. pylori. Sebagian besar menggunakan kombinasi dua antibiotik dan inhibitor pompa proton. Terkadang bismut ditambahkan ke rejimen. "],
        "context_set": [""]
    },
    {
        "tag": "Flu Kucing",
        "patterns": ["berat badan kucing turun, kucing bersin-bersin dan tidak mau makan. mata kucing juga membengkak dan berair", "kucing saya tidak mau makan dan mengurus. ia bersin-bersin dan matanya berair. kucing saya juga terlihat pucat dan lesu. suaranya juga berubah", "Kucing saya berat badannya berkurang sampai turun kurus, kayaknya gara gara nafsu makannya berkurang sampai hilang tidak mau makan lagi. Dia juga lemah lesu, pucat, suaranya berubah. Sering bersin, sama matanya bengkak berair gitu"],
        "responses": ["Polyprenyl immunostimulant adalah satu-satunya pengobatan yang saat ini disetujui di AS untuk rhinotracheitis kucing yang disebabkan oleh herpesvirus. Efektivitas ditunjukkan dalam sebuah studi klinis dengan kucing yang secara eksperimental terinfeksi herpesvirus kucing: 20 kucing diobati dengan imunostimulan poliprenil dan 20 menerima plasebo. Studi ini menetapkan bahwa tingkat keparahan penyakit ini lebih rendah pada kelompok yang diobati dengan poliprenil. Keselamatan ditunjukkan pada 390 kucing milik pribadi dari usia 2 hari hingga 16 tahun, yang tinggal di 10 negara bagian (ibid).\n\nAntibiotik biasanya digunakan untuk mencegah infeksi bakteri sekunder. Tidak ada obat antivirus khusus yang umum digunakan saat ini untuk FVR, meskipun satu penelitian telah menunjukkan bahwa ganciclovir, PMEDAP, dan cidofovir menjanjikan pengobatan. Penelitian yang lebih baru telah menunjukkan bahwa famciclovir sistemik efektif dalam mengobati infeksi ini pada kucing tanpa efek samping yang dilaporkan dengan agen anti-virus lainnya. Kasus yang lebih parah mungkin memerlukan perawatan suportif seperti terapi cairan intravena, terapi oksigen, atau bahkan tabung makan. Konjungtivitis dan ulkus kornea diobati dengan antibiotik topikal untuk infeksi bakteri sekunder. Lisin umumnya digunakan sebagai pengobatan; Namun, dalam tinjauan sistematis 2015, para penulis menyelidiki semua uji klinis dengan kucing serta studi in vitro dan menyimpulkan bahwa suplementasi lisin kemungkinan tidak efektif untuk pengobatan atau pencegahan infeksi herpesvirus kucing 1.\n\n-Vaksin\nAda vaksin untuk FHV-1 yang tersedia (kode ATCvet: QI06AA08 (WHO), ditambah berbagai vaksin kombinasi), tetapi meskipun membatasi atau melemahkan tingkat keparahan penyakit dan dapat mengurangi penumpahan virus, itu tidak mencegah infeksi dengan FVR. Penelitian telah menunjukkan durasi kekebalan vaksin ini setidaknya tiga tahun. Penggunaan serologi untuk menunjukkan antibodi yang bersirkulasi terhadap FHV-1 telah terbukti memiliki nilai prediktif positif untuk menunjukkan perlindungan dari penyakit ini.\n\n-Mencegah penyebaran virus\nSebagian besar disinfektan rumah tangga akan menonaktifkan FHV-1. Virus ini dapat bertahan hidup hingga 18 jam di lingkungan yang lembab, tetapi lebih sedikit di lingkungan yang kering dan hanya sebentar sebagai aerosol."],
        "context_set": [""]
    },
    {
        "tag": "Stud Tail",
        "patterns": ["kucing saya bulunya rontok dan berminyak, ada bintik coklat di ujung ekornya", "kucing saya bulunya berminyak dan bau. di pangkal ekornya ada bercak kecoklatan", "Kucing saya ada bercak coklat di ekornya, mana rontok berminyak sama bau lagi"],
        "responses": ["Definisi:\nPerubahan warna atau sifat berminyak di sekitar pangkal ekor kucing Anda.\n\nPenyebab:\nKondisi ini disebabkan oleh kelenjar sebaceous yang terlalu aktif yang terletak di dekat pangkal ekor. Kelenjar sebaceous adalah kelenjar khusus yang menghasilkan sekresi lilin atau berminyak yang digunakan oleh folikel rambut. Dalam jumlah normal, minyak menjaga rambut tetap lembut dan fleksibel, tetapi sebum yang berlebihan dapat menyebabkan akumulasi lilin dan berminyak.\n\nPenanganan:\n1. Penting untuk menjaga area bersih dan bebas dari kotoran kulit\n2. Menggunakan sampo anti-seborrhea secara teratur untuk mencegah penumpukan akumulasi sebum yang berminyak serta untuk mencegah penumpukan rambut kusut.\n3. Dalam kasus di mana infeksi menjadi perhatian ketika terdapat bau dan cairan, antibiotik mungkin diperlukan.\n4. Seperti biasa, Anda disarankan untuk membawa kucing Anda ke dokter hewan untuk evaluasi menyeluruh. "],
        "context_set": [""]
    },
    {
        "tag": "Sporotrichosis",
        "patterns": ["kucing saya lemes ga mau makan dan ada benjol di kakinya", "kucing saya ada luka besar sekali di mukanya dan ada juga luka benjolan. ia tidak nafsu makan. saya lihat di kakinya juga ada infeksi.", "Kucing saya itu ada luka luka benjolan, lukanya berair sama berkerak. Dikakinya ada infeksi, mulutnya luka juga. Dihidungnya ada lesi sama luka lagi, di wajahnya ada lesi juga. Gara gara semua luka itu, dia nafsu makannya berkurang sampai hilang tidak mau makan lagi"],
        "responses": ["Definisi:\nInfeksi yang disebabkan oleh jamur yang disebut Sporothrix.\n\nPenyebab:\nLesi ini berkembang dari luka yang terjadi selama perkelahian dengan kucing yang terinfeksi. Kucing yang menjilati luka yang terinfeksi di bagian lain dari tubuhnya juga dapat memindahkan jamur ke wajah dan mulutnya.\n\nPenanganan:\n1. Itrakonazol adalah obat pilihan untuk sporotrikosis kucing.\n2. Untuk penyakit berat atau refrakter, kapsul kalium iodida adalah biasanya digunakan dalam kombinasi dengan itrakonazol.\n3. Durasi pengobatan biasanya pada setidaknya 1 bulan setelah klinis temuan menyelesaikan. "],
        "context_set": [""]
    },
    {
        "tag": "Kutu Lice kucing",
        "patterns": ["bulu kucing saya menipis dan warnanya pucet, dia sering garuk karena ada jerawat sama komedo", "kucing saya garuk-garuk terus, bulunya juga terlihat kusam dan menipis. ada jerawat dan komedo juga.", "Kucing saya itu komedoan, jerawatan, bulunya juga pucat sama kayak menipis gitu. Dia suka garukgarukin itu yg jerawatan ngga bahaya kah"],
        "responses": ["Definisi:\nKucing yang terserang kutu.\n\nPenyebab:\nTertular oleh kucing lain.\n\nPenanganan:\n1. Isolasi Kucing Anda: Ini hanya langkah yang diperlukan jika Anda memiliki lebih dari satu kucing di rumah Anda dan diperlukan untuk mencegah mentransfer kutu ke kucing lain.\n\n2. Perawatan Obat: Dokter hewan Anda akan merekomendasikan perawatan insektisida untuk kucing Anda, yang mungkin termasuk mencuci obat atau sampo. Yang terbaik adalah berbicara dengan dokter hewan Anda sehingga Anda dapat memastikan obat itu aman untuk kucing Anda.\n\n3. Perawatan Rumah: Anda juga dapat meminta dokter hewan Anda untuk merekomendasikan produk untuk menyingkirkan kutu di sekitar rumah. Ada berbagai semprotan dan bubuk yang dirancang untuk menghilangkan nits dan kutu dari rumah Anda. Ini adalah langkah penting.\n\n4. Mencukur Bulu: Dokter hewan Anda hanya akan merekomendasikan mencukur bulu jika kusut parah. Seharusnya tidak diperlukan untuk mengobati sebagian besar infeksi. "],
        "context_set": [""]
    },
    {
        "tag": "Ringworm kucing",
        "patterns": ["kucing saya bulunya rontok dan patah, sering garuk kulitnya yg kering merah ada bintik botaknya, dagunya bengkak, ada luka basah di belakang leher dan luka bulet di kaki bagian depan", "kucing saya garuk-garuk terus dan saya lihat ada kerak melingkar di badannya. kulitnya juga memerah dan ada luka basah di belakang leher. ada bintik botak dan bulunya rontok.", "Kucing saya ada kulit yg memerah gitu, ada keraknya, bintik botak, bulunya rontok, patah patah, ada ketombenya. Terus kulitnya kayak kering gitu, dagunya bengkak, ada luka aneh juga di kaki depan, sama basah dibelakan leher. Parahnya dia suka garuk itu yg berdarah sama berkerak itu"],
        "responses": ["Definisi:\nRingworm adalah infeksi kulit umum yang disebabkan oleh jamur. Disebut \"Ringworm\" karena dapat menyebabkan ruam melingkar (berbentuk seperti cincin) yang biasanya berwarna merah dan gatal.\n\nPenyebab: Jamur.\n\nPenanganan:\n1. Perawatan antijamur termasuk agen topikal seperti miconazole, terbinafine, clotrimazole, ketoconazole, atau tolnaftate diterapkan dua kali sehari sampai gejala sembuh. Biasanya dalam satu atau dua minggu.\n\n2. Perawatan topikal kemudian harus dilanjutkan selama 7 hari lebih lanjut setelah resolusi gejala yang terlihat untuk mencegah kekambuhan.\n\n3. Oleh karena itu, durasi total pengobatan umumnya dua minggu, tetapi mungkin selama tiga minggu.\n\n4. Dalam kasus yang lebih parah atau ruam kulit kepala, pengobatan sistemik dengan obat oral dapat diberikan.\n\n5. Untuk mencegah penyebaran infeksi, lesi tidak boleh disentuh, dan kebersihan yang baik dijaga dengan mencuci tangan dan tubuh. "],
        "context_set": [""]
    },
    {
        "tag": "Allergic Dermatitis kucing",
        "patterns": ["kucing saya bulunya rontok karena sering di garuk sampe merah kulitnya juga ada kerak", "kucing saya menggaruk berlebihan dan kulitnya memerah. beberapa hari yang lalu saya baru mengganti makanannya dengan merk yang lain", "kucing saya tu kulitnya memerah gitu, ada keraknya juga. Mana suka dia garuk lagi takut jadinya. Bulunya ada rontok juga, terus dia kena radang gitu"],
        "responses": ["Definisi:\nAlergi yang dialami oleh kucing dan mempengaruhi kondisi kulit kucing.\n\nPenyebab:\n1. Gigitan kutu\n2. Alergi makanan\n3. Alergi karena kondisi lingkungan.\n\nPenanganan:\n1. Dermatitis alergi pada kucing dapat diobati dengan beberapa cara, termasuk penghindaran alergen, terapi simtomatik, imunoterapi atau terapi penekan kekebalan tubuh.\n2. Menjauhkan kucing Anda dari sumber alergen.\n3. Terapi Simtomatik: Antimikroba, sampo obat, salep, suplemen dan obat-obatan lain dapat digunakan untuk mengobati gejala yang terkait dengan dermatitis alergi.\n4. Imunoterapi: Proses desensitisasi kucing terhadap alergen melalui penggunaan protein alergen.\n5. Terapi Imunosupresif: Mengobati kondisi kucing dengan steroid dan obat siklosporin untuk mengurangi respons imun. "],
        "context_set": [""]
    },
    {
        "tag": "Pemphigus kucing",
        "patterns": ["kucing saya panas tinggi hingga bulunya rontok dia sering garuk sampe kulitnya merah, badannya ada bopeng dan bengkak", "kucing saya garuk-garuk terus dan ada bopeng di sekitar mata. bagian pada tubuhnya juga ada yang bengkak.", "Kucing saya itu ada bengkak sama rontok bulunya. Kulitnya memerah, terus suka dia garuk ga jelas gitu. Dia juga kena demam kayaknya"],
        "responses": ["Definisi:\nPemphigus adalah sekelompok lima penyakit kulit autoimun yang ditandai dengan vesikel dan bula (\"lepuh\") besar dan kecil di mulut dan pada sambungan mukokutan (persimpangan antara kulit dan jaringan mukosa). Daerah yang sering terkena termasuk kelopak mata, bibir, lubang hidung, dan anus.\n\nPenyebab: Autoimun.\n\nPenanganan:\nPengobatan membutuhkan penekanan kekebalan dan imunomodulator. Jangan mengobati daun pemphigus tanpa diagnosis dan penghapusan diferensial lainnya.\n1. Glukokortikoid adalah pengobatan awal yang paling umum, karena mereka adalah agen anti-inflamasi dan  imunomodulator yang kuat. Ada banyak mekanisme tindakan yang berguna dalam pengobatan penyakit kulit autoimun, tetapi yang paling menonjol adalah efek pada kekebalan humoral dan dimediasi sel, pertahanan fagosit, penghambatan mediator inflamasi, dan penekanan tingkat autoantibodi.\n\n2. Chlorambucil paling sering digunakan pada kucing ketika monoterapi glukokortikoid tidak cukup. Seseorang harus memantau myelosuppression selain muntah, diare, dan anoreksia. CBC dengan jumlah trombosit direkomendasikan sebelum pengobatan dan seperti yang ditunjukkan selama pengobatan.\n\n3. Chyrsotherapy adalah penggunaan garam emas. Penggunaan chrysotherapy dan glukokortikoid telah terbukti efektif dalam pengobatan feline PF. Garam emas memiliki efek imunomodulator dan anti-inflamasi.\n\n4. Siklosporin adalah obat imunosupresif nonsteroid yang kadang-kadang diresepkan. Respon klinis bervariasi dalam penyakit autoimun dan paling sering dilembagakan dalam upaya untuk mengurangi jumlah glukokortikoid yang digunakan. Efek samping termasuk muntah, diare, anoreksia, penurunan berat badan, hiperplasia gingiva, hirsutisme, dan papillomatosis. "],
        "context_set": [""]
    },
    {
        "tag": "Feline Acne",
        "patterns": ["kucing saya bulunya jadi pucet dan tipis, ada luka benjol bernanah, dan jerawat juga komedo di dagu", "kucing saya ada luka berbentuk benjolan dan bernanah. warna bulunya pucat dan di sekitar dagunya ada jerawat", "Kucing saya ada luka benjolan bernanah ih. Bulunya juga menipis warnanya memucat. juga Komedoan sama jewaratan disekitar dagu "],
        "responses": ["Definisi:\nKucing yang berjerawat memiliki banyak komedo di dagu dan bibirnya, dan dagunya mungkin tampak \"kotor\". Komedo dapat berkembang menjadi abses kecil yang pecah dan membentuk krusta. Dalam kasus yang parah, saluran pengeringan, rambut rontok, dan pembengkakan dapat terjadi di dagu. Ini mungkin gatal dan menyebabkan kucing Anda menggaruk, yang dapat menyebabkan lebih banyak trauma pada area tersebut. Infeksi bakteri sekunder sering berkembang.\n\nPenyebab:\nBeberapa faktor tampaknya terkait dengan perkembangannya termasuk stres, sistem kekebalan yang menurun, kebiasaan perawatan yang buruk, adanya penyakit lain, kontak atau dermatitis atopik, dan kondisi kulit di mana jumlah yang tidak normal. minyak diproduksi dan folikel rambut tidak berfungsi dengan baik.\n\nPenanganan:\n1. Karena beberapa kucing alergi terhadap plastik, Anda harus beralih ke mangkuk makanan dan air dari baja tahan karat. Cuci mangkuk setiap hari dengan sabun dan air panas. Piring yang dangkal dapat mencegah kontak dengan dagu.\n\n2. Tisu obat dapat digunakan untuk kucing yang rentan mengalami jerawat di dagu atau untuk kucing yang memiliki kebiasaan perawatan yang buruk.\n\n3. Sampo antiseboroik, seperti yang mengandung benzoil peroksida (pada konsentrasi 3% atau kurang) atau gel benzoil peroksida dapat digunakan untuk memecah minyak berlebih dan membersihkan pori-pori.\n\n4. Suplementasi dengan asam lemak mungkin bermanfaat.\n\n5. Antibiotik oral atau topikal, seperti mupirocin, dapat digunakan jika ada infeksi bakteri sekunder.\n\n6. Jika ada peradangan dalam jumlah besar, kortikosteroid jangka pendek, seperti prednisolon, dapat diresepkan. "],
        "context_set": [""]
    },
    {
        "tag": "Cat Scratch Disease",
        "patterns": ["kucing saya demam udah berhari-hari, ada cacing dimuntahannya, matanya merah, dan lemes karena ga mau makan", "kucing saya muntah-muntah dan saya lihat di dekat lehernya ada benjolan. apa kelenjar getah beningnya bengkak? matanya memerah dan ia terlihat kelelahan. ", "Kucing saya udah demam 3 hari, dia kelelahan sama muntah muntah gitu. Mana ada cacing di muntahnya. Matanya memerah, sama pas dicek kelenjar getah beningnya membengkak. Itu semua membuat dia tidak nafsu makan lagi "],
        "responses": ["Definisi:\nCat scratch disease (CSD) adalah infeksi yang disebabkan oleh bakteri Bartonella henselae, dan spesies Bartonella lainnya yang lebih jarang.\n\nPenyebab:\nKucing dapat terinfeksi B. henselae dari gigitan kutu dan kotoran kutu (kotoran) yang masuk ke dalam lukanya. Dengan menggaruk dan menggigit kutu, kucing mengambil kotoran kutu yang terinfeksi di bawah kuku dan sela-sela giginya.\n\nPenanganan:\n1. Gunakan produk perawatan dan pencegahan kutu yang efektif direkomendasikan dan tersedia dari dokter hewan Anda.\n\n2. Bicaralah dengan dokter hewan Anda tentang pengujian dan perawatan untuk kucing Anda. Dokter hewan Anda dapat memberi tahu Anda apakah kucing Anda memerlukan pengujian atau perawatan. "],
        "context_set": [""]
    },
    {
        "tag": "Giardia",
        "patterns": ["kucing saya pup terus dan fesesya berminyak", "kucing saya diare dan terlihat pupnya berminyak", "Kucing saya diarean sampai BABnya berminyak. Dia juga dehidrasi gitu"],
        "responses": ["Definisi:\nGiardia adalah parasit kecil (kuman) yang menyebabkan penyakit diare giardiasis. Giardia ditemukan di permukaan atau di tanah, makanan, atau air yang telah terkontaminasi dengan kotoran (kotoran) dari orang atau hewan yang terinfeksi.\n\nPenyebab:\n1. Berada dalam kontak dengan kotoran yang terinfeksi dari anjing atau kucing lain\n\n2. Berguling dan bermain di tanah yang terkontaminasi\n\n3. Menjilat tubuhnya setelah kontak dengan permukaan yang terkontaminasi (misalnya, kotak kotoran atau kandang anjing atau peti yang kotor)\n\n4. Minum air dari sungai, kolam, atau badan air lain yang terkontaminasi.\n\nPenanganan:\n1. Jika hewan peliharaan Anda mengalami diare yang tidak kunjung sembuh, carilah perawatan dokter hewan. Diare memiliki penyebab yang berbeda dan dapat mengakibatkan dehidrasi atau masalah serius lainnya.\n\n2. Diagnosis dan pengobatan infeksi Giardia harus dilakukan oleh dokter hewan berlisensi.\n\n3. Tidak ada pengobatan bebas yang disetujui yang tersedia untuk infeksi Giardia.\n\n4. Giardia dapat ditularkan melalui kotoran secara singkat, dan seekor hewan mungkin tampak sehat atau tanpa tanda-tanda penyakit sebelum ia berhenti mengeluarkan Giardia. Tes kotoran berulang mungkin diperlukan.\n\n5. Ikuti rekomendasi dokter hewan Anda dan bawa hewan peliharaan Anda ke semua janji tindak lanjut."],
        "context_set": [""]
    },
    {
        "tag": "Leptospirosis",
        "patterns": ["mata dan mulut kucing saya berwarna kuning, berat badannya turun ga nafsu makan lemes banget, badannya panas banget, pipisnya berdarah", "kucing saya pipisnya berdarah dan muntah-muntah. ia tidak mau makan hingga berat badannya juga berkurang. saya perhatikan mulut dan mata kuning", "Kucing saya itu lemah lesu sampai demam pucat sama diarean muntah gitu. Berat badannya berkurang kurus, dehidrasi, nafsu makannya juga berkurang sampai hilang tidak mau makan. Mata sama mulutnya kekuningan ada salah makan kah? Kencingnya berdarah lagi"],
        "responses": ["Definisi:\nLeptospirosis adalah infeksi darah yang disebabkan oleh bakteri Leptospira.\n\nPenyebab:\nTerpapar urin atau liur dari hewan terinfeksi lainnya.\n\nPenanganan:\n1. Diet khusus melalui infus\n2. Diberi antibiotik secepatnya karena bila melewati 7 hari sejak mulai timbul gejala kurang bermanfaat. "],
        "context_set": [""]
    },
    {
        "tag": "Cacing Pita Kucing",
        "patterns": ["ada sesuatu warnanya putih kecil bergerak di pup kucing saya", "kucing saya di pantatnya ada putih-putih kecil bergerak", "Kucing saya ada putih putih kecil bergerak di kotorannya"],
        "responses": ["Definisi:\nCacing pita kucing adalah parasit yang menyebar ke anjing, kucing, dan manusia melalui konsumsi kutu yang terinfeksi. Parasit ini umum pada kucing tetapi jarang menyebabkan penyakit pada hewan peliharaan atau manusia.\n\nPenyebab:\nCacing pita menyebar ketika kucing atau orang menelan kutu yang terinfeksi.\n\nPenanganan:\n1. Obat resep yang disebut praziquantel diberikan, baik secara oral atau injeksi (khusus hewan peliharaan). Obat tersebut menyebabkan cacing pita larut di dalam usus. Karena cacing biasanya dicerna sebelum lewat, cacing itu mungkin tidak terlihat di kotoran kucing Anda. Obat-obatan umumnya ditoleransi dengan baik.\n2. Bicaralah dengan dokter hewan Anda tentang pengujian dan perawatan untuk kucing Anda. Dokter hewan Anda dapat memberi tahu Anda apakah kucing Anda memerlukan pengujian atau perawatan. "],
        "context_set": [""]
    },
    {
        "tag": "Cacing Tambang Kucing",
        "patterns": ["perut kucing saya buncit tapi berat badannya turun dan kurusan", "kucing saya badannya mengurus tetapi perutnya membuncit. dan dia seperti kurang darah.", "Kucing saya kena anemia sampai berat badannya berkurang kurus, tapi anehnya perutnya malah membucit. Ada infeksi juga kayaknya"],
        "responses": ["Definisi:\nCacing tambang adalah cacing kecil yang dapat menyebar melalui kontak dengan tanah atau pasir yang terkontaminasi.\n\nPenyebab:\nKucing menelan tanah atau air yang mengandung larva.\n\nPenanganan:\n1. Berikan pirantel palmoat dan milbemycin oxime secara oral\n2. Berikan selamectin secara topikal (dioleskan). Tidak cocok untuk kucing < 8 minggu "],
        "context_set": [""]
    },
    {
        "tag": "Feline Chlamydia",
        "patterns": ["mata kucing saya bengkak berair, dia juga lemes batuk pilek terus", "kucing saya batuk-batuk dan bersin. pernapasannya terganggu. hidungnya berair dan ada cairan putih pada mata", "Kucing saya sering batuk sama bersin sampai kena gangguan pernafasan kayaknya, hidungnya juga meler ingusan berair gitu. Matanya bengkak merah berair, sering nyipitkan mata atau nutup sebelah mata, ada cairannya juga kadang kuning kadang putih. Semua itu membuat dia lemah lesu gimana ya"],
        "responses": ["Definisi:\nChlamydia kucing adalah penyakit yang disebabkan oleh infeksi bakteri Chlamydia felis (C. felis).\n\nPenyebab:\nTerpapar tetesan cairan yang keluar dari mata atau hidung kucing yang terinfeksi penyakit ini.\n\nPenanganan:\n1. Dibutuhkan pemeriksaan fisik menyeluruh oleh Dokter Hewan untuk menentukan apakah kucing Anda terkena chlamydia\n\n2. Antibiotik biasanya diberikan untuk mengobati klamidia pada kucing. Biasanya diberikan Tetrasiklin.\n\n3. Jika klamidia hanya mempengaruhi mata kucing Anda, maka antibiotik topikal, yang dioleskan langsung ke mata itu sendiri, mungkin berhasil mengobati infeksi.\n\n4. Jika infeksinya parah atau telah menyebar ke saluran pernapasan atas atau bawah, kucing Anda mungkin memerlukan terapi antibiotik oral atau suntik.\n\n5. Antibiotik biasanya membawa kesembuhan yang cepat pada infeksi klamidia, meskipun begitu kucing Anda perlu terus menggunakannya hingga tiga minggu, bahkan setelah gejalanya hilang.\n\n6. Jika kucing Anda tidak mulai membaik dengan cepat dengan pengobatan, atau jika kondisinya tampak memburuk meskipun telah diobati, hubungi dokter hewan Anda. Kucing Anda mungkin menderita infeksi virus yang menghambat pemulihannya."],
        "context_set": [""]
    },
    {
        "tag": "Distemper kucing",
        "patterns": ["mata kucing saya merah dan berair, kulitnya kering, pupnya berdarah, badannya panas banget", "kucing saya sangat kurus. beberapa hari ini diare berdarah dan muntah-muntah hingga dehidrasi. ia tidak aktif seperti biasanya dan hanya telentang dengan kaki ke atas dan kepala terkulai. hidungnya berair dan matanya merah.", "Kucing saya demam, panas dia. Kena diare juga, mana bau lagi. Kayaknya kena dehidrasi juga dia"],
        "responses": ["Definisi:\nDistemper kucing, disebut juga feline panleukopenia (FPV) adalah penyakit virus yang bisa menjangkiti kucing dan bersifat sangat menular dan sangat mematikan sehingga berpotensi mengancam nyawa. Penyakit ini menyerang sel darah merah di saluran usus, sumsum tulang, kulit, dan sel induk. Penyakit ini juga bisa memicu anemia serta penyakit virus dan bakteri lainnya. Setelah menghancurkan sel darah merah, infeksi akan mudah menyerang kucing karena tidak ada sistem pertahanan tubuh yang melindungi kucing.\n\nPenyebab:\nDistemper disebabkan adanya kontak yang dilakukan kucing terhadap saliva, kotoran hidung, darah, air seni, hingga feses dari kucing yang telah terinfeksi. Bahkan, kutu juga bisa menjadi perantara penularan penyakit ini.\n\nPenanganan:\n1. Begitu kamu menemukan gejala-gejala penyakit distemper pada kucingmu, segera konsultasikan dengan dokter hewan langgananmu.\n\n2. Kucing yang menderita distemper harus dikarantina untuk menghindari penyebaran virus ke kucing lain.\n\n3. Sebagai pemilik, kamu harus menyediakan berbagai kebutuhan nutrisinya agar kucing tidak mengalami dehidrasi maupun malnutrisi.\n\n4. Beberapa tes yang akan dilakukan antara lain:\n- Tes virus leukemia kucing (FeLV)\n- Tes virus imunodefisiensi kucing (FIV)\n- Perhitungan darah lengkap (Complete Blood Count/CBC)\n- Tes elektrolit\n- Tes urin dan feses\n- Foto rontgen dada dan perut"],
        "context_set": [""]
    }
  ]
}